Autodesk.Revit.DB.CurveNode.GetCurve
Returns the geometric curve object corresponding to the node.
Returns:
The curve.
Since:
2016

Autodesk.Revit.DB.CurveNode
An output node that represents a model curve.
Remarks:
See also: Autodesk::Revit::DB::IModelExportContext::OnCurve.
Since:
2016